package com.makunpeng.common.utils;

import java.util.Random;

public class StringHelp {

	public static boolean hasLength(String src) {
		return null!=src&& src.length()>0;
	}
	public static boolean hasText(String src) {
		return null != src && src.trim().length()> 0;
	}
	public static String randomChinese() {
		String string=null;
		int highPos,lowPos;
		Random random=new Random();
		highPos = (176 + Math.abs(random.nextInt(40)));
		
		random=new Random();		
		lowPos=161+Math.abs(random.nextInt(94));
		
		byte[] barr=new byte[2];
		barr[0]=(new Integer(highPos)).byteValue();
		barr[1]=(new Integer(lowPos)).byteValue();
		try {
			string=new String(barr,"GB2312");
		} catch (Exception e) {
			// TODO: handle exception
			e.printStackTrace();
		}
		return string;
	}
	public static String randomChineseString(int length) {
		StringBuffer sv=new StringBuffer();
		for (int i = 0; i < length; i++) {
			sv.append(randomChinese());
			
		}
		return sv.toString();
	}
	
	public static String generateChineseName() {
		String [] str=  {"ÕÔ","Ç®","Ëï","Àî","ÖÜ","Îâ","Ö£",""
				+ "Íõ","·ë","³Â","èú","ÎÀ","½¯","Éò","º«","Ñî","Öì",
				"ÇØ","ÓÈ","Ðí","ºÎ","ÂÀ","Ê©","ÕÅ","¿×","²Ü","ÑÏ","»ª","½ð",
				"Îº","ÌÕ","½ª","ÆÝ","Ð»","×Þ","Ó÷","°Ø","Ë®","ñ¼","ÕÂ","ÔÆ","ËÕ"
				,"ÅË","¸ð","ÞÉ","·¶","Åí","ÀÉ","Â³","Î¤","²ý","Âí","Ãç","·ï","»¨",
				"·½","Óá","ÈÎ","Ô¬","Áø","Ûº","±«","Ê·","ÌÆ","·Ñ","Á®","á¯","Ñ¦","À×",
				"ºØ","Äß","ÌÀ","ëø","Òó","ÂÞ","±Ï","ºÂ","Úù","°²","³£","ÀÖ","ÓÚ","Ê±","¸µ",
				"Æ¤","±å","Æë","¿µ","Îé","Óà","Ôª","²·","¹Ë","ÃÏ","Æ½","»Æ","ºÍ","ÄÂ","Ïô",
				"Òü","Ò¦","ÉÛ","Õ¿","Íô","Æî","Ã«","Óí","µÒ","Ã×","±´","Ã÷","ê°","¼Æ","·ü",
				"³É","´÷","Ì¸","ËÎ","Ã©","ÅÓ","ÐÜ","¼Í","Êæ","Çü","Ïî","×£","¶­","Áº","¶Å","Èî",
				"À¶","Ãö","Ï¯","¼¾","Âé","Ç¿","¼Ö","Â·","Â¦","Î£","½­","Í¯","ÑÕ","¹ù","Ã·","Ê¢","ÁÖ",
				"µó","ïñ","Ðì","Çð","Âæ","¸ß","ÏÄ","²Ì","Ìï","·®","ºú","Áè","»ô","ÓÝ","Íò","Ö§","¿Â",
				"êÃ","¹Ü","Â¬","Äª","¾­","·¿","ôÃ","çÑ","¸É","½â","Ó¦","×Ú","¶¡","Ðû","êÚ","µË","Óô",
				"µ¥","º¼","ºé","°ü","Öî","×ó","Ê¯","´Þ","¼ª","Å¥","¹¨","³Ì","ïú","ÐÏ","»¬","Åá","Â½",
				"ÈÙ","ÎÌ","Ü÷","Ñò","ì¶","»Ý","Õç","üL","¼Ò","·â","ÜÇ","ôà","´¢","½ù","¼³","Úû","ÃÓ",
				"ËÉ","¾®","¶Î","¸»","Î×","ÎÚ","½¹","°Í","¹­","ÄÁ","Úó","É½","¹È","³µ","ºî","åµ","Åî",
				"È«","Û­","°à","Ñö","Çï","ÖÙ","ÒÁ","¹¬","Äþ","³ð","èï","±©","¸Ê","Ð±","À÷","ÈÖ","×æ",
				"Îä","·û","Áõ","¾°","Õ²","Êø","Áú","Ò¶","ÐÒ","Ë¾","ÉØ","Û¬","Àè","¼»","±¡","Ó¡","ËÞ","°×","»³","ÆÑ","Û¢","´Ó","¶õ","Ë÷","ÏÌ","¼®","Àµ","×¿","Ýþ","ÍÀ","ÃÉ","³Ø","ÇÇ","Òõ","Óô","ñã","ÄÜ","²Ô","Ë«","ÎÅ","Ý·","µ³","µÔ","Ì·","¹±","ÀÍ","åÌ","¼§","Éê","·ö","¶Â","È½","Ô×","Ûª","Óº","àS","è³","É£","¹ð","å§","Å£","ÊÙ","Í¨","±ß","ìè","Ñà","¼½","Û£","ÆÖ","ÉÐ","Å©","ÎÂ","±ð","×¯","êÌ","²ñ","öÄ","ÑÖ","³ä","Ä½","Á¬","Èã","Ï°","»Â","°¬","Óã","ÈÝ","Ïò","¹Å","Ò×","É÷","¸ê","ÁÎ","â×","ÖÕ","ôß","¾Ó","ºâ","²½","¶¼","¹¢","Âú","ºë","¿ï","¹ú","ÎÄ","¿Ü","¹ã","Â»","ãÚ","¶«","Å·","ì¯","ÎÖ","Àû","Îµ","Ô½","Ùç","Â¡","Ê¦","¹®","ØÇ","Äô","êË","¹´","°½","ÈÚ","Àä","ö¤","ÐÁ","ãÛ","ÄÇ","¼ò","ÈÄ","¿Õ","Ôø","Îã","É³","Ø¿","Ñø","¾Ï","Ðë","·á","³²","¹Ø","Øá","Ïà","²é","ºó","¾£","ºì","ÓÎ","óÃ","È¨","åÏ","¸Ç","Òæ","»¸","¹«","½ú","³þ","ÑÖ","·¨","Èê","Û³","Í¿","ÇÕ","ÔÀ","Ë§","çÃ","¿º","¿ö","ºó","ÓÐ","ÇÙ","ÉÌ","Ä²","ÙÜ","Ù¦","²®","ÉÍ","Ä«","¹þ","ÚÛ","óÎ","Äê","°®","Ñô","Ù¡","ÍòÙ¹","Ë¾Âí","ÉÏ¹Ù","Å·Ñô","ÏÄºî","Öî¸ð","ÎÅÈË","¶«·½","ºÕÁ¬","»Ê¸¦","Î¾³Ù","¹«Ñò","å£Ì¨","¹«Ò±","×ÚÕþ","å§Ñô","´¾ÓÚ","µ¥ÓÚ","Ì«Êå","ÉêÍÀ","¹«Ëï","ÖÙËï","ÐùÔ¯","Áîºü","ïñÀë","ÓîÎÄ","³¤Ëï","Ä½ÈÝ","ÏÊÓÚ","ãÌÇð","Ë¾Í½","Ë¾¿Õ","Ø¢¹Ù","Ë¾¿Ü","Øë","¶½","×Ó³µ","ò§Ëï","¶ËÄ¾","Î×Âí","¹«Î÷","Æáµñ","ÀÖÕý","ÈÀæá","¹«Á¼","ÍØ°Î","¼Ð¹È","Ô×¸¸","¹ÈÁº","¶Î¸É","°ÙÀï","¶«¹ù","ÄÏÃÅ","ºôÑÓ","¹é","º£","ÑòÉà","Î¢Éú","ÁºÇð","×óÇð","¶«ÃÅ","Î÷ÃÅ","ÄÏ¹¬"};
			String name = str[RandomHelp.random(0,str.length-1)];
			String name1=randomChineseString(RandomHelp.random(1, 2));
			return name+name1;
	}
}
